backend/controllers/DictionaryController.php

    protected function findModel($id)
    {
        if (($model = Dictionary::findOne($id)) !== null) {
---
SELECT * FROM `dictionary` WHERE `id`='3'