backend/controllers/LanguageController.php

    protected function findModel($id)
    {
        if (($model = Language::findOne($id)) !== null) {
---
SELECT * FROM `language` WHERE `id`='1'