backend/controllers/PageController.php

SELECT * FROM `page` WHERE `id`='82'
---
    protected function findModel($id)
    {
        if (($model = Page::findOne($id)) !== null) {