backend/controllers/ProductVarController.php

SELECT * FROM `product_var` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = ProductVar::findOne($id)) !== null) {