backend/controllers/TemplateController.php

SELECT * FROM `template` WHERE `id`='56'
---
    protected function findModel($id)
    {
        if (($model = Template::findOne($id)) !== null) {