backend/controllers/TrackingCodeController.php

SELECT * FROM `tracking_code` WHERE `id`='25'
---
    protected function findModel($id)
    {
        if (($model = TrackingCode::findOne($id)) !== null) {