backend/views/page/_form.php

                'delimiter' => '-',
            ])?>

            <?= $form->field($model, 'parent_id')->widget(Select2::classname(), [
                'data' => ArrayHelper::map(Page::find()->all(), 'id', 'name'),
                'language' => 'en',
                'options' => ['placeholder' => 'Výber rodiča ...'],
                'pluginOptions' => [
                    'allowClear' => true
                ],
            ]); ?>
---
SELECT * FROM `page`