backend/views/page/index.php

                },
                'size' => '3',
            ],
            [
                'label' => 'Akcie',
                'value' => function ($data) {
                    $result = '';

                    $result .= Html::a('<span class="fa fa-eye"></span>', Url::to(['show', 'id' => $data->id]), [
                        'target' => '_blank'
                    ]) . ' ';

                    $result .= Html::a('<span class="fa fa-files-o"></span>', Url::to(['edit', 'id' => $data->id, 'duplicate' => true]), [
                        //'target' => '_blank'
                    ]) . ' ';

                    if ($data->getPages()->count() == 0) {

                        $result .= '' . Html::a('', Url::to(['delete', 'id' => $data->id]), [
                                'class' => 'glyphicon glyphicon-trash',
                                'data' => [
                                    'confirm' => 'Skutočne chcete odstrániť podstránku ' . $data->name . '?',
                                    'method' => 'post'
                                ]
                            ]);
---
SELECT * FROM `page` WHERE 0=1