backend/models/TrackingCode.php

SELECT `id`, `name` FROM `tracking_code_place` WHERE `id`=2
---
    public function getPlace()
    {
        return (new Query())
            ->select(['id', 'name'])
            ->from('tracking_code_place')
            ->where(['id' => $this->place_id])
            ->one();