backend/views/product-var/_form.php

SELECT * FROM `var_type`
---

    <label class="control-label" for="productvar-product_type">For Product Types</label>
    <?php
    $productTypes = ProductType::find()->all();