backend/views/product/index.php

SELECT * FROM `product` WHERE 0=1
---
                },
                'size' => '3',
            ],
            [
                'label' => 'Akcie',
                'value' => function ($data) {
                    $result = '';
                    $result .= Html::a('<span class="fa fa-files-o"></span>',
                        Url::to(['edit', 'id' => $data->id, 'duplicate' => true]), [
                            'target' => '_blank'
                        ]);

                    $result .= '' . Html::a('', Url::to(['delete', 'id' => $data->id]), [
                            'class' => 'glyphicon glyphicon-trash',
                            'data' => [
                                'confirm' => 'Skutočne chcete odstrániť produkt ' . $data->name . '?',
                                'method' => 'post'
                            ]
                        ]);

                    /*if ($data->getProducts()->count() == 0) {
                        $result .= Html::a('<a class="glyphicon glyphicon-trash" data-confirm="Skutočne chcete odstrániť tento produkt (' . $data->name . ')?" data-method="post" data-pjax="0"></a>',
                            Url::to(['delete', 'id' => $data->id]));
                    }*/
                    return $result;